{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [
        {
            "id": 0,
            "content": "[STOP]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 1,
            "content": "[UNK]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 2,
            "content": "[SPACE]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        }
    ],
    "normalizer": null,
    "pre_tokenizer": {
        "type": "Whitespace"
    },
    "post_processor": null,
    "decoder": null,
    "model": {
        "type": "BPE",
        "dropout": null,
        "unk_token": "[UNK]",
        "continuing_subword_prefix": null,
        "end_of_word_suffix": null,
        "fuse_unk": false,
        "byte_fallback": false,
        "ignore_merges": false,
        "vocab": {
            "[STOP]": 0,
            "[UNK]": 1,
            "[SPACE]": 2,
            "'": 3,
            "<": 4,
            "=": 5,
            ">": 6,
            "[": 7,
            "a": 8,
            "b": 9,
            "d": 10,
            "e": 11,
            "f": 12,
            "g": 13,
            "h": 14,
            "i": 15,
            "j": 16,
            "k": 17,
            "l": 18,
            "m": 19,
            "n": 20,
            "o": 21,
            "p": 22,
            "q": 23,
            "r": 24,
            "s": 25,
            "t": 26,
            "u": 27,
            "v": 28,
            "y": 29,
            "z": 30,
            "al": 31,
            "ah": 32,
            "an": 33,
            "at": 34,
            "as": 35,
            "ar": 36,
            "am": 37,
            "ad": 38,
            "ak": 39,
            "ab": 40,
            "aq": 41,
            "ana": 42,
            "ash": 43,
            "iah": 44,
            "af": 45,
            "aly": 46,
            "aj": 47,
            "fy": 48,
            "aa": 49,
            "in": 50,
            "aan": 51,
            "en": 52,
            "sh": 53,
            "alah": 54,
            "alm": 55,
            "ala": 56,
            "ol": 57,
            "akh": 58,
            "man": 59,
            "adh": 60,
            "aany": 61,
            "adah": 62,
            "ath": 63,
            "yaany": 64,
            "ma": 65,
            "kh": 66,
            "ir": 67,
            "alam": 68,
            "arah": 69,
            "dah": 70,
            "bat": 71,
            "az": 72,
            "ia": 73,
            "gh": 74,
            "atah": 75,
            "aaly": 76,
            "ho": 77,
            "mash": 78,
            "aam": 79,
            "kan": 80,
            "bi": 81,
            "ou": 82,
            "alo": 83,
            "aqy": 84,
            "alt": 85,
            "aah": 86,
            "la": 87,
            "alat": 88,
            "als": 89,
            "akan": 90,
            "ama": 91,
            "il": 92,
            "asat": 93,
            "oo": 94,
            "or": 95,
            "aham": 96,
            "aad": 97,
            "alh": 98,
            "aha": 99,
            "aln": 100,
            "ih": 101,
            "em": 102,
            "aty": 103,
            "id": 104,
            "ada": 105,
            "ajah": 106,
            "eiah": 107,
            "tab": 108,
            "bas": 109,
            "aal": 110,
            "hana": 111,
            "arat": 112,
            "ib": 113,
            "vah": 114,
            "araf": 115,
            "any": 116,
            "alas": 117,
            "aqol": 118,
            "dy": 119,
            "it": 120,
            "agh": 121,
            "arab": 122,
            "kadah": 123,
            "aaah": 124,
            "asah": 125,
            "asar": 126,
            "aash": 127,
            "anah": 128,
            "av": 129,
            "alf": 130,
            "on": 131,
            "kal": 132,
            "ehana": 133,
            "iq": 134,
            "anat": 135,
            "hy": 136,
            "od": 137,
            "ald": 138,
            "abah": 139,
            "aamal": 140,
            "abat": 141,
            "ya": 142,
            "ady": 143,
            "baqy": 144,
            "jada": 145,
            "iz": 146,
            "atar": 147,
            "amah": 148,
            "hajah": 149,
            "mah": 150,
            "aman": 151,
            "adar": 152,
            "enat": 153,
            "alak": 154,
            "ei": 155,
            "iha": 156,
            "alsh": 157,
            "kanat": 158,
            "alj": 159,
            "aradh": 160,
            "aro": 161,
            "alk": 162,
            "alq": 163,
            "tabaa": 164,
            "val": 165,
            "bal": 166,
            "aat": 167,
            "mat": 168,
            "aaraf": 169,
            "if": 170,
            "ahar": 171,
            "akar": 172,
            "ish": 173,
            "hat": 174,
            "ik": 175,
            "amakan": 176,
            "akat": 177,
            "asal": 178,
            "lo": 179,
            "mo": 180,
            "ban": 181,
            "is": 182,
            "iav": 183,
            "et": 184,
            "aaiz": 185,
            "amal": 186,
            "aratak": 187,
            "had": 188,
            "of": 189,
            "alaq": 190,
            "abar": 191,
            "ajat": 192,
            "akal": 193,
            "alr": 194,
            "aashan": 195,
            "adharatak": 196,
            "abaqy": 197,
            "lama": 198,
            "adam": 199,
            "kat": 200,
            "araj": 201,
            "ahad": 202,
            "im": 203,
            "el": 204,
            "mas": 205,
            "naf": 206,
            "aniah": 207,
            "zy": 208,
            "math": 209,
            "vab": 210,
            "alnas": 211,
            "aloq": 212,
            "aab": 213,
            "ale": 214,
            "alb": 215,
            "vat": 216,
            "qol": 217,
            "baad": 218,
            "alaha": 219,
            "irah": 220,
            "akalam": 221,
            "sah": 222,
            "asam": 223,
            "atha": 224,
            "ha": 225,
            "ba": 226,
            "aanad": 227,
            "alab": 228,
            "aqah": 229,
            "asab": 230,
            "arak": 231,
            "mamakan": 232,
            "ay": 233,
            "ot": 234,
            "masar": 235,
            "tam": 236,
            "bah": 237,
            "hadharatak": 238,
            "alaf": 239,
            "enah": 240,
            "sha": 241,
            "aqat": 242,
            "lan": 243,
            "lakan": 244,
            "alkh": 245,
            "mathala": 246,
            "maham": 247,
            "vam": 248,
            "anin": 249,
            "ashar": 250,
            "asatath": 251,
            "rab": 252,
            "aain": 253,
            "abal": 254,
            "ouy": 255
        },
        "merges": [
            [
                "a",
                "l"
            ],
            [
                "a",
                "h"
            ],
            [
                "a",
                "n"
            ],
            [
                "a",
                "t"
            ],
            [
                "a",
                "s"
            ],
            [
                "a",
                "r"
            ],
            [
                "a",
                "m"
            ],
            [
                "a",
                "d"
            ],
            [
                "a",
                "k"
            ],
            [
                "a",
                "b"
            ],
            [
                "a",
                "q"
            ],
            [
                "an",
                "a"
            ],
            [
                "as",
                "h"
            ],
            [
                "i",
                "ah"
            ],
            [
                "a",
                "f"
            ],
            [
                "al",
                "y"
            ],
            [
                "a",
                "j"
            ],
            [
                "f",
                "y"
            ],
            [
                "a",
                "a"
            ],
            [
                "i",
                "n"
            ],
            [
                "a",
                "an"
            ],
            [
                "e",
                "n"
            ],
            [
                "s",
                "h"
            ],
            [
                "al",
                "ah"
            ],
            [
                "al",
                "m"
            ],
            [
                "al",
                "a"
            ],
            [
                "o",
                "l"
            ],
            [
                "ak",
                "h"
            ],
            [
                "m",
                "an"
            ],
            [
                "ad",
                "h"
            ],
            [
                "aan",
                "y"
            ],
            [
                "ad",
                "ah"
            ],
            [
                "at",
                "h"
            ],
            [
                "y",
                "aany"
            ],
            [
                "m",
                "a"
            ],
            [
                "k",
                "h"
            ],
            [
                "i",
                "r"
            ],
            [
                "al",
                "am"
            ],
            [
                "ar",
                "ah"
            ],
            [
                "d",
                "ah"
            ],
            [
                "b",
                "at"
            ],
            [
                "a",
                "z"
            ],
            [
                "i",
                "a"
            ],
            [
                "g",
                "h"
            ],
            [
                "at",
                "ah"
            ],
            [
                "a",
                "aly"
            ],
            [
                "h",
                "o"
            ],
            [
                "m",
                "ash"
            ],
            [
                "a",
                "am"
            ],
            [
                "k",
                "an"
            ],
            [
                "b",
                "i"
            ],
            [
                "o",
                "u"
            ],
            [
                "al",
                "o"
            ],
            [
                "aq",
                "y"
            ],
            [
                "al",
                "t"
            ],
            [
                "a",
                "ah"
            ],
            [
                "l",
                "a"
            ],
            [
                "al",
                "at"
            ],
            [
                "al",
                "s"
            ],
            [
                "ak",
                "an"
            ],
            [
                "am",
                "a"
            ],
            [
                "i",
                "l"
            ],
            [
                "as",
                "at"
            ],
            [
                "o",
                "o"
            ],
            [
                "o",
                "r"
            ],
            [
                "ah",
                "am"
            ],
            [
                "a",
                "ad"
            ],
            [
                "al",
                "h"
            ],
            [
                "ah",
                "a"
            ],
            [
                "al",
                "n"
            ],
            [
                "i",
                "h"
            ],
            [
                "e",
                "m"
            ],
            [
                "at",
                "y"
            ],
            [
                "i",
                "d"
            ],
            [
                "ad",
                "a"
            ],
            [
                "aj",
                "ah"
            ],
            [
                "e",
                "iah"
            ],
            [
                "t",
                "ab"
            ],
            [
                "b",
                "as"
            ],
            [
                "a",
                "al"
            ],
            [
                "h",
                "ana"
            ],
            [
                "ar",
                "at"
            ],
            [
                "i",
                "b"
            ],
            [
                "v",
                "ah"
            ],
            [
                "ar",
                "af"
            ],
            [
                "an",
                "y"
            ],
            [
                "al",
                "as"
            ],
            [
                "aq",
                "ol"
            ],
            [
                "d",
                "y"
            ],
            [
                "i",
                "t"
            ],
            [
                "a",
                "gh"
            ],
            [
                "ar",
                "ab"
            ],
            [
                "k",
                "adah"
            ],
            [
                "aa",
                "ah"
            ],
            [
                "as",
                "ah"
            ],
            [
                "as",
                "ar"
            ],
            [
                "a",
                "ash"
            ],
            [
                "an",
                "ah"
            ],
            [
                "a",
                "v"
            ],
            [
                "al",
                "f"
            ],
            [
                "o",
                "n"
            ],
            [
                "k",
                "al"
            ],
            [
                "e",
                "hana"
            ],
            [
                "i",
                "q"
            ],
            [
                "an",
                "at"
            ],
            [
                "h",
                "y"
            ],
            [
                "o",
                "d"
            ],
            [
                "al",
                "d"
            ],
            [
                "ab",
                "ah"
            ],
            [
                "aam",
                "al"
            ],
            [
                "ab",
                "at"
            ],
            [
                "y",
                "a"
            ],
            [
                "ad",
                "y"
            ],
            [
                "b",
                "aqy"
            ],
            [
                "j",
                "ada"
            ],
            [
                "i",
                "z"
            ],
            [
                "at",
                "ar"
            ],
            [
                "am",
                "ah"
            ],
            [
                "h",
                "ajah"
            ],
            [
                "m",
                "ah"
            ],
            [
                "am",
                "an"
            ],
            [
                "ad",
                "ar"
            ],
            [
                "en",
                "at"
            ],
            [
                "al",
                "ak"
            ],
            [
                "e",
                "i"
            ],
            [
                "ih",
                "a"
            ],
            [
                "al",
                "sh"
            ],
            [
                "kan",
                "at"
            ],
            [
                "al",
                "j"
            ],
            [
                "ar",
                "adh"
            ],
            [
                "ar",
                "o"
            ],
            [
                "al",
                "k"
            ],
            [
                "al",
                "q"
            ],
            [
                "tab",
                "aa"
            ],
            [
                "v",
                "al"
            ],
            [
                "b",
                "al"
            ],
            [
                "a",
                "at"
            ],
            [
                "m",
                "at"
            ],
            [
                "a",
                "araf"
            ],
            [
                "i",
                "f"
            ],
            [
                "ah",
                "ar"
            ],
            [
                "ak",
                "ar"
            ],
            [
                "i",
                "sh"
            ],
            [
                "h",
                "at"
            ],
            [
                "i",
                "k"
            ],
            [
                "am",
                "akan"
            ],
            [
                "ak",
                "at"
            ],
            [
                "as",
                "al"
            ],
            [
                "l",
                "o"
            ],
            [
                "m",
                "o"
            ],
            [
                "b",
                "an"
            ],
            [
                "i",
                "s"
            ],
            [
                "ia",
                "v"
            ],
            [
                "e",
                "t"
            ],
            [
                "aa",
                "iz"
            ],
            [
                "am",
                "al"
            ],
            [
                "arat",
                "ak"
            ],
            [
                "h",
                "ad"
            ],
            [
                "o",
                "f"
            ],
            [
                "al",
                "aq"
            ],
            [
                "ab",
                "ar"
            ],
            [
                "aj",
                "at"
            ],
            [
                "ak",
                "al"
            ],
            [
                "al",
                "r"
            ],
            [
                "aash",
                "an"
            ],
            [
                "adh",
                "aratak"
            ],
            [
                "ab",
                "aqy"
            ],
            [
                "l",
                "ama"
            ],
            [
                "ad",
                "am"
            ],
            [
                "k",
                "at"
            ],
            [
                "ar",
                "aj"
            ],
            [
                "ah",
                "ad"
            ],
            [
                "i",
                "m"
            ],
            [
                "e",
                "l"
            ],
            [
                "m",
                "as"
            ],
            [
                "n",
                "af"
            ],
            [
                "an",
                "iah"
            ],
            [
                "z",
                "y"
            ],
            [
                "m",
                "ath"
            ],
            [
                "v",
                "ab"
            ],
            [
                "aln",
                "as"
            ],
            [
                "alo",
                "q"
            ],
            [
                "a",
                "ab"
            ],
            [
                "al",
                "e"
            ],
            [
                "al",
                "b"
            ],
            [
                "v",
                "at"
            ],
            [
                "q",
                "ol"
            ],
            [
                "b",
                "aad"
            ],
            [
                "alah",
                "a"
            ],
            [
                "ir",
                "ah"
            ],
            [
                "ak",
                "alam"
            ],
            [
                "s",
                "ah"
            ],
            [
                "as",
                "am"
            ],
            [
                "ath",
                "a"
            ],
            [
                "h",
                "a"
            ],
            [
                "b",
                "a"
            ],
            [
                "aan",
                "ad"
            ],
            [
                "al",
                "ab"
            ],
            [
                "aq",
                "ah"
            ],
            [
                "as",
                "ab"
            ],
            [
                "ar",
                "ak"
            ],
            [
                "m",
                "amakan"
            ],
            [
                "a",
                "y"
            ],
            [
                "o",
                "t"
            ],
            [
                "m",
                "asar"
            ],
            [
                "t",
                "am"
            ],
            [
                "b",
                "ah"
            ],
            [
                "h",
                "adharatak"
            ],
            [
                "al",
                "af"
            ],
            [
                "en",
                "ah"
            ],
            [
                "sh",
                "a"
            ],
            [
                "aq",
                "at"
            ],
            [
                "l",
                "an"
            ],
            [
                "l",
                "akan"
            ],
            [
                "al",
                "kh"
            ],
            [
                "math",
                "ala"
            ],
            [
                "m",
                "aham"
            ],
            [
                "v",
                "am"
            ],
            [
                "an",
                "in"
            ],
            [
                "ash",
                "ar"
            ],
            [
                "asat",
                "ath"
            ],
            [
                "r",
                "ab"
            ],
            [
                "aa",
                "in"
            ],
            [
                "ab",
                "al"
            ],
            [
                "ou",
                "y"
            ]
        ],
        "language": "ar"
    }
}