{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [
        {
            "id": 0,
            "content": "[STOP]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 1,
            "content": "[UNK]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 2,
            "content": "[SPACE]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        }
    ],
    "normalizer": null,
    "pre_tokenizer": {
        "type": "Whitespace"
    },
    "post_processor": null,
    "decoder": null,
    "model": {
        "type": "BPE",
        "dropout": null,
        "unk_token": "[UNK]",
        "continuing_subword_prefix": null,
        "end_of_word_suffix": null,
        "fuse_unk": false,
        "byte_fallback": false,
        "ignore_merges": false,
        "vocab": {
            "[STOP]": 0,
            "[UNK]": 1,
            "[SPACE]": 2,
            ".": 3,
            ":": 4,
            "،": 5,
            "؛": 6,
            "؟": 7,
            "ء": 8,
            "آ": 9,
            "أ": 10,
            "ؤ": 11,
            "إ": 12,
            "ئ": 13,
            "ا": 14,
            "ب": 15,
            "ة": 16,
            "ت": 17,
            "ث": 18,
            "ج": 19,
            "ح": 20,
            "خ": 21,
            "د": 22,
            "ذ": 23,
            "ر": 24,
            "ز": 25,
            "س": 26,
            "ش": 27,
            "ص": 28,
            "ض": 29,
            "ط": 30,
            "ظ": 31,
            "ع": 32,
            "غ": 33,
            "ف": 34,
            "ق": 35,
            "ك": 36,
            "ل": 37,
            "م": 38,
            "ن": 39,
            "ه": 40,
            "و": 41,
            "ى": 42,
            "ي": 43,
            "ً": 44,
            "ٌ": 45,
            "ٍ": 46,
            "َ": 47,
            "ُ": 48,
            "ِ": 49,
            "ّ": 50,
            "ْ": 51,
            "َا": 52,
            "ال": 53,
            "لَ": 54,
            "وَ": 55,
            "ِي": 56,
            "َّ": 57,
            "نْ": 58,
            "الْ": 59,
            "أَ": 60,
            "عَ": 61,
            "مَ": 62,
            "هُ": 63,
            "تَ": 64,
            "لِ": 65,
            "فَ": 66,
            "هِ": 67,
            "ُو": 68,
            "بِ": 69,
            "مِ": 70,
            "رَ": 71,
            "نَ": 72,
            "يَ": 73,
            "لَّ": 74,
            "مَا": 75,
            "يْ": 76,
            "بَ": 77,
            "نَّ": 78,
            "مُ": 79,
            "قَ": 80,
            "َالَ": 81,
            "لَا": 82,
            "وَا": 83,
            "مْ": 84,
            "كَ": 85,
            "عْ": 86,
            "لْ": 87,
            "مِنْ": 88,
            "رِ": 89,
            "فِي": 90,
            "قَالَ": 91,
            "سَ": 92,
            "ًا": 93,
            "ُّ": 94,
            "هَا": 95,
            "حَ": 96,
            "دَ": 97,
            "سْ": 98,
            "عَلَ": 99,
            "بْ": 100,
            "نِ": 101,
            "إِ": 102,
            "لُ": 103,
            "وْ": 104,
            "دْ": 105,
            "ةِ": 106,
            "تِ": 107,
            "اللَّ": 108,
            "رُ": 109,
            "عِ": 110,
            "رْ": 111,
            "هَ": 112,
            "عَنْ": 113,
            "نُ": 114,
            "ِّ": 115,
            "جَ": 116,
            "َّا": 117,
            "فْ": 118,
            "ذَا": 119,
            "مَنْ": 120,
            "صَ": 121,
            "َاء": 122,
            "قْ": 123,
            "كُ": 124,
            "ِيَ": 125,
            "كَا": 126,
            "بُ": 127,
            "عُ": 128,
            "يُ": 129,
            "أَنَّ": 130,
            "خَ": 131,
            "حْ": 132,
            "وَقَالَ": 133,
            "تْ": 134,
            "أَنْ": 135,
            "يْهِ": 136,
            "تُ": 137,
            "سِ": 138,
            "ةُ": 139,
            "اللَّهُ": 140,
            "ذَ": 141,
            "دِ": 142,
            "حِ": 143,
            "قَدْ": 144,
            "النَّ": 145,
            "عَلَى": 146,
            "دُ": 147,
            "كْ": 148,
            "نَا": 149,
            "حُ": 150,
            "الْمَ": 151,
            "الْأَ": 152,
            "هْ": 153,
            "بَعْ": 154,
            "عَا": 155,
            "إلَ": 156,
            "شَ": 157,
            "عَلَيْهِ": 158,
            "غَ": 159,
            "وَالْ": 160,
            "رَا": 161,
            "بِي": 162,
            "قِ": 163,
            "رُو": 164,
            "فِ": 165,
            "الْمُ": 166,
            "تَّ": 167,
            "يَا": 168,
            "خْ": 169,
            "ضُ": 170,
            "سْتَ": 171,
            "بَا": 172,
            "كَانَ": 173,
            "ئِ": 174,
            "جْ": 175,
            "طَ": 176,
            "ضَ": 177,
            "َاءِ": 178,
            "وَلَا": 179,
            "فَإِ": 180,
            "فَا": 181,
            "بِهِ": 182,
            "لَمْ": 183,
            "رِي": 184,
            "وَإِ": 185,
            "ةٌ": 186,
            "بَعْضُ": 187,
            "لِي": 188,
            "وَأَ": 189,
            "نِي": 190,
            "سَا": 191,
            "ةَ": 192,
            "ثَ": 193,
            "رَّ": 194,
            "سُ": 195,
            "إلَى": 196,
            "صْ": 197,
            "حَا": 198,
            "وَال": 199,
            "قُ": 200,
            "هُمْ": 201,
            "فُ": 202,
            "جَا": 203,
            "الش": 204,
            "وَسَ": 205,
            "جِ": 206,
            "كُو": 207,
            "أُ": 208,
            "زَ": 209,
            "قِي": 210,
            "كِ": 211,
            "ءِ": 212,
            "دَا": 213,
            "الْعَ": 214,
            "مَّا": 215,
            "بْنُ": 216,
            "لِكَ": 217,
            "دَّ": 218,
            "أْ": 219,
            "الس": 220,
            "قَا": 221,
            "لَّمَ": 222,
            "وَقَدْ": 223,
            "ذَلِكَ": 224,
            "لَّى": 225,
            "ةً": 226,
            "صَلَّى": 227,
            "مَّ": 228,
            "وَسَلَّمَ": 229,
            "دِي": 230,
            "مُو": 231,
            "صَا": 232,
            "لَهُ": 233,
            "شْ": 234,
            "أَوْ": 235,
            "ةٍ": 236,
            "غْ": 237,
            "اللَّهِ": 238,
            "إذَا": 239,
            "ثُ": 240,
            "فَقَالَ": 241,
            "نَفْ": 242,
            "كَمَا": 243,
            "طَا": 244,
            "أَنَّهُ": 245,
            "لُو": 246,
            "وَلَ": 247,
            "جُ": 248,
            "الص": 249,
            "الْإِ": 250,
            "الْحَ": 251,
            "التَّ": 252,
            "هُوَ": 253,
            "تِهِ": 254,
            "فَإِنَّ": 255
        },
        "merges": [
            [
                "َ",
                "ا"
            ],
            [
                "ا",
                "ل"
            ],
            [
                "ل",
                "َ"
            ],
            [
                "و",
                "َ"
            ],
            [
                "ِ",
                "ي"
            ],
            [
                "َ",
                "ّ"
            ],
            [
                "ن",
                "ْ"
            ],
            [
                "ال",
                "ْ"
            ],
            [
                "أ",
                "َ"
            ],
            [
                "ع",
                "َ"
            ],
            [
                "م",
                "َ"
            ],
            [
                "ه",
                "ُ"
            ],
            [
                "ت",
                "َ"
            ],
            [
                "ل",
                "ِ"
            ],
            [
                "ف",
                "َ"
            ],
            [
                "ه",
                "ِ"
            ],
            [
                "ُ",
                "و"
            ],
            [
                "ب",
                "ِ"
            ],
            [
                "م",
                "ِ"
            ],
            [
                "ر",
                "َ"
            ],
            [
                "ن",
                "َ"
            ],
            [
                "ي",
                "َ"
            ],
            [
                "لَ",
                "ّ"
            ],
            [
                "م",
                "َا"
            ],
            [
                "ي",
                "ْ"
            ],
            [
                "ب",
                "َ"
            ],
            [
                "ن",
                "َّ"
            ],
            [
                "م",
                "ُ"
            ],
            [
                "ق",
                "َ"
            ],
            [
                "َا",
                "لَ"
            ],
            [
                "ل",
                "َا"
            ],
            [
                "و",
                "َا"
            ],
            [
                "م",
                "ْ"
            ],
            [
                "ك",
                "َ"
            ],
            [
                "ع",
                "ْ"
            ],
            [
                "ل",
                "ْ"
            ],
            [
                "مِ",
                "نْ"
            ],
            [
                "ر",
                "ِ"
            ],
            [
                "ف",
                "ِي"
            ],
            [
                "ق",
                "َالَ"
            ],
            [
                "س",
                "َ"
            ],
            [
                "ً",
                "ا"
            ],
            [
                "ُ",
                "ّ"
            ],
            [
                "ه",
                "َا"
            ],
            [
                "ح",
                "َ"
            ],
            [
                "د",
                "َ"
            ],
            [
                "س",
                "ْ"
            ],
            [
                "عَ",
                "لَ"
            ],
            [
                "ب",
                "ْ"
            ],
            [
                "ن",
                "ِ"
            ],
            [
                "إ",
                "ِ"
            ],
            [
                "ل",
                "ُ"
            ],
            [
                "و",
                "ْ"
            ],
            [
                "د",
                "ْ"
            ],
            [
                "ة",
                "ِ"
            ],
            [
                "ت",
                "ِ"
            ],
            [
                "ال",
                "لَّ"
            ],
            [
                "ر",
                "ُ"
            ],
            [
                "ع",
                "ِ"
            ],
            [
                "ر",
                "ْ"
            ],
            [
                "ه",
                "َ"
            ],
            [
                "عَ",
                "نْ"
            ],
            [
                "ن",
                "ُ"
            ],
            [
                "ِ",
                "ّ"
            ],
            [
                "ج",
                "َ"
            ],
            [
                "َّ",
                "ا"
            ],
            [
                "ف",
                "ْ"
            ],
            [
                "ذ",
                "َا"
            ],
            [
                "مَ",
                "نْ"
            ],
            [
                "ص",
                "َ"
            ],
            [
                "َا",
                "ء"
            ],
            [
                "ق",
                "ْ"
            ],
            [
                "ك",
                "ُ"
            ],
            [
                "ِي",
                "َ"
            ],
            [
                "ك",
                "َا"
            ],
            [
                "ب",
                "ُ"
            ],
            [
                "ع",
                "ُ"
            ],
            [
                "ي",
                "ُ"
            ],
            [
                "أَ",
                "نَّ"
            ],
            [
                "خ",
                "َ"
            ],
            [
                "ح",
                "ْ"
            ],
            [
                "وَ",
                "قَالَ"
            ],
            [
                "ت",
                "ْ"
            ],
            [
                "أَ",
                "نْ"
            ],
            [
                "يْ",
                "هِ"
            ],
            [
                "ت",
                "ُ"
            ],
            [
                "س",
                "ِ"
            ],
            [
                "ة",
                "ُ"
            ],
            [
                "اللَّ",
                "هُ"
            ],
            [
                "ذ",
                "َ"
            ],
            [
                "د",
                "ِ"
            ],
            [
                "ح",
                "ِ"
            ],
            [
                "قَ",
                "دْ"
            ],
            [
                "ال",
                "نَّ"
            ],
            [
                "عَلَ",
                "ى"
            ],
            [
                "د",
                "ُ"
            ],
            [
                "ك",
                "ْ"
            ],
            [
                "ن",
                "َا"
            ],
            [
                "ح",
                "ُ"
            ],
            [
                "الْ",
                "مَ"
            ],
            [
                "الْ",
                "أَ"
            ],
            [
                "ه",
                "ْ"
            ],
            [
                "بَ",
                "عْ"
            ],
            [
                "ع",
                "َا"
            ],
            [
                "إ",
                "لَ"
            ],
            [
                "ش",
                "َ"
            ],
            [
                "عَلَ",
                "يْهِ"
            ],
            [
                "غ",
                "َ"
            ],
            [
                "وَا",
                "لْ"
            ],
            [
                "ر",
                "َا"
            ],
            [
                "ب",
                "ِي"
            ],
            [
                "ق",
                "ِ"
            ],
            [
                "ر",
                "ُو"
            ],
            [
                "ف",
                "ِ"
            ],
            [
                "الْ",
                "مُ"
            ],
            [
                "ت",
                "َّ"
            ],
            [
                "ي",
                "َا"
            ],
            [
                "خ",
                "ْ"
            ],
            [
                "ض",
                "ُ"
            ],
            [
                "سْ",
                "تَ"
            ],
            [
                "ب",
                "َا"
            ],
            [
                "كَا",
                "نَ"
            ],
            [
                "ئ",
                "ِ"
            ],
            [
                "ج",
                "ْ"
            ],
            [
                "ط",
                "َ"
            ],
            [
                "ض",
                "َ"
            ],
            [
                "َاء",
                "ِ"
            ],
            [
                "وَ",
                "لَا"
            ],
            [
                "فَ",
                "إِ"
            ],
            [
                "ف",
                "َا"
            ],
            [
                "بِ",
                "هِ"
            ],
            [
                "لَ",
                "مْ"
            ],
            [
                "ر",
                "ِي"
            ],
            [
                "وَ",
                "إِ"
            ],
            [
                "ة",
                "ٌ"
            ],
            [
                "بَعْ",
                "ضُ"
            ],
            [
                "ل",
                "ِي"
            ],
            [
                "وَ",
                "أَ"
            ],
            [
                "ن",
                "ِي"
            ],
            [
                "س",
                "َا"
            ],
            [
                "ة",
                "َ"
            ],
            [
                "ث",
                "َ"
            ],
            [
                "ر",
                "َّ"
            ],
            [
                "س",
                "ُ"
            ],
            [
                "إلَ",
                "ى"
            ],
            [
                "ص",
                "ْ"
            ],
            [
                "ح",
                "َا"
            ],
            [
                "وَا",
                "ل"
            ],
            [
                "ق",
                "ُ"
            ],
            [
                "هُ",
                "مْ"
            ],
            [
                "ف",
                "ُ"
            ],
            [
                "ج",
                "َا"
            ],
            [
                "ال",
                "ش"
            ],
            [
                "وَ",
                "سَ"
            ],
            [
                "ج",
                "ِ"
            ],
            [
                "ك",
                "ُو"
            ],
            [
                "أ",
                "ُ"
            ],
            [
                "ز",
                "َ"
            ],
            [
                "ق",
                "ِي"
            ],
            [
                "ك",
                "ِ"
            ],
            [
                "ء",
                "ِ"
            ],
            [
                "د",
                "َا"
            ],
            [
                "الْ",
                "عَ"
            ],
            [
                "م",
                "َّا"
            ],
            [
                "بْ",
                "نُ"
            ],
            [
                "لِ",
                "كَ"
            ],
            [
                "د",
                "َّ"
            ],
            [
                "أ",
                "ْ"
            ],
            [
                "ال",
                "س"
            ],
            [
                "ق",
                "َا"
            ],
            [
                "لَّ",
                "مَ"
            ],
            [
                "وَ",
                "قَدْ"
            ],
            [
                "ذَ",
                "لِكَ"
            ],
            [
                "لَّ",
                "ى"
            ],
            [
                "ة",
                "ً"
            ],
            [
                "صَ",
                "لَّى"
            ],
            [
                "م",
                "َّ"
            ],
            [
                "وَسَ",
                "لَّمَ"
            ],
            [
                "د",
                "ِي"
            ],
            [
                "م",
                "ُو"
            ],
            [
                "ص",
                "َا"
            ],
            [
                "لَ",
                "هُ"
            ],
            [
                "ش",
                "ْ"
            ],
            [
                "أَ",
                "وْ"
            ],
            [
                "ة",
                "ٍ"
            ],
            [
                "غ",
                "ْ"
            ],
            [
                "اللَّ",
                "هِ"
            ],
            [
                "إ",
                "ذَا"
            ],
            [
                "ث",
                "ُ"
            ],
            [
                "فَ",
                "قَالَ"
            ],
            [
                "نَ",
                "فْ"
            ],
            [
                "كَ",
                "مَا"
            ],
            [
                "ط",
                "َا"
            ],
            [
                "أَنَّ",
                "هُ"
            ],
            [
                "ل",
                "ُو"
            ],
            [
                "وَ",
                "لَ"
            ],
            [
                "ج",
                "ُ"
            ],
            [
                "ال",
                "ص"
            ],
            [
                "الْ",
                "إِ"
            ],
            [
                "الْ",
                "حَ"
            ],
            [
                "ال",
                "تَّ"
            ],
            [
                "هُ",
                "وَ"
            ],
            [
                "تِ",
                "هِ"
            ],
            [
                "فَإِ",
                "نَّ"
            ]
        ],
        "language": "ar"
    }
}